# NSPerMSup2 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..NSPerMSup2 Property
SymbolTypeId Class See Also
---
Symbol N·s/m², indicating unit Newton seconds per square meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId NSPerMSup2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NSPerMSup2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ NSPerMSup2 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace